#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>
//打印的图案模板   
 /*  *
    ***
   *****
  *******
 *********
***********
 *********
  *******
   *****
    ***
	 *       */
//打印方法采用上下部分+先空格再*打印 
//好处：1.防止输入偶数其实打印的不是菱形（中间那行加偶行总为奇数行）.
//      2.输入一个数就可看到你想要的菱形图 (^-^)

//（不采取11个printf打印因为1.打印行数100行得累死。。2.修改贼麻烦）
int main()
{
	int line = 0;
	scanf("%d", &line);//输入的是上半行，打印的内容自己规定我包括了中间行
	//打印上半部分
	int i = 0;
	for (i = 0; i < line; i++)
	{
		//打印空格
		int j = 0;
		for (j = 0; j <line-1-i ; j++)
		{
			printf(" ");//用循环来打印每一行变化的空格
		}
		//打印*
		for (j = 0; j < 2*i+1 ; j++)
		{
			printf("*");
		}
		printf("\n");
	}

	//打印下半部分
	for (i = 0; i < line - 1; i++)
	{
		//打印空格
		int j = 0;//还要有这句话因为这是这个循环里头的j作用域变了
		for (j = 0; j <= i; j++)
		{
			printf(" ");
		}
		for (j = 0; j < 2*(line-1-i)-1; j++)
		{
			printf("*");
		}
		printf("\n");
	}


	return 0;
}	
	

